import { useState, useRef, useEffect } from "react";
import { Runtime, Inspector } from "@observablehq/runtime";
import * as Dialog from "@radix-ui/react-dialog";
import notebook from "@skaram82/elections-2023-data-vizualizations-ianus";

function SurveyForm() {
  const [step, setStep] = useState(0);
  const [formData, setFormData] = useState({
    user_id: '',
    q1: '',
    q2: '',
    q3: '',
    q4: '',
    q5: '',
    q6: '',
    q7: '',
    q8: '',
    q9: '',
  });
  const [errorVal, setErrorVal] = useState("");
  // define chart refs for embedding charts from observable
  const zoomable_treemapRef = useRef();
  const stepChart1Ref = useRef();
  const stepChart2Ref = useRef();
  const stepChart3Ref = useRef();
  const speedChart_mitsotakis_newRef = useRef();
  const legendSentimentRef = useRef();
  const speedChart_tsiprasRef = useRef();
  const legendSentiment2Ref = useRef();

  const handleNext = () => {
    if (step === 0) {
      if (formData.user_id === "" || formData.user_id.length <= 1) {
        setErrorVal("Please enter a valid user ID");
      } else {
        setErrorVal("");
        setStep(step + 1);
        window.scrollTo(0, 0);
      }
    } else if (step === 1) {
      setStep(step + 1);
      window.scrollTo(0, 0);
    } else if (step === 2) {
      if (formData.q1 === "" || formData.q3 === "") {
        setErrorVal("Please answer the required fields");
      } else {
        setErrorVal("");
        setStep(step + 1);
        window.scrollTo(0, 0);
      }
    } else if (step === 3) {
      if (formData.q4 === "" || formData.q5 === "") {
        setErrorVal("Please answer the required fields");
      } else {
        setErrorVal("");
        setStep(step + 1);
        window.scrollTo(0, 0);
      }
    } else if (step === 4) {
      if (formData.q6 === "") {
        setErrorVal("Please answer the required fields");
      } else {
        setErrorVal("");
        setStep(step + 1);
        window.scrollTo(0, 0);
      }
    } 
    else if (step === 5) {
      if (formData.q7 === "" || formData.q8 === "" || formData.q9 === "") {
        setErrorVal("Please answer the required fields");
      } else {
        setErrorVal("");
        setStep(step + 1);
        window.scrollTo(0, 0);
      }
    } else {
      setErrorVal("");
      setStep(0);
      setFormData({
        user_id: '',
        q1: '',
        q2: '',
        q3: '',
        q4: '',
        q5: '',
        q6: '',
        q7: '',
        q8: '',
        q9: '',
      });
      window.scrollTo(0, 0);
    }
  };

  const handlePrev = () => {
    setStep(step - 1);
    window.scrollTo(0, 0);
  };

  useEffect(() => {
    const runtime = new Runtime();
    runtime.module(notebook, name => {
      if (name === "zoomable_treemap") return new Inspector(zoomable_treemapRef.current);
      if (name === "StepChart1") return new Inspector(stepChart1Ref.current);
      if (name === "StepChart2") return new Inspector(stepChart2Ref.current);
      if (name === "StepChart3") return new Inspector(stepChart3Ref.current);
      if (name === "speedChart_mitsotakis_new") return new Inspector(speedChart_mitsotakis_newRef.current);
      if (name === "legendSentiment") return new Inspector(legendSentimentRef.current);
      if (name === "speedChart_tsipras") return new Inspector(speedChart_tsiprasRef.current);
      if (name === "legendSentiment2") return new Inspector(legendSentiment2Ref.current);
    });
    return () => runtime.dispose();
  }, []);

  return (
    <div className="w-full px-24 py-4">   
    <ol className="flex items-center w-full mb-4 sm:mb-5">
      <li className={`flex w-full items-center after:content-[''] after:w-full after:h-1 after:border-b after:border-4 after:inline-block text-blue-500 ${step === 0 ? "" : "after:border-blue-100"}`}>
        <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 bg-blue-100`}>
          <svg className="w-4 h-4 text-blue-600 lg:w-6 lg:h-6" xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 497 512">
            <path d="M 337 82 L 336 74 Q 329 40 295 33 L 287 32 Q 273 28 273 14 Q 277 0 291 0 L 300 1 Q 327 6 345 24 Q 363 42 368 69 L 369 78 Q 370 92 355 96 Q 341 97 337 82 L 337 82 Z M 81 69 Q 111 42 147 53 Q 152 43 160 35 Q 180 16 205 16 Q 231 16 251 35 L 369 153 L 369 148 Q 370 121 388 103 Q 406 84 433 84 Q 460 84 478 103 Q 496 121 497 148 L 497 306 Q 497 308 497 310 Q 497 311 497 311 Q 497 312 497 312 Q 495 397 439 453 Q 383 509 299 512 L 298 512 L 297 512 L 297 512 L 290 512 Q 208 511 149 453 L 36 340 Q 17 320 17 295 Q 17 269 36 250 Q 42 244 48 240 L 47 238 Q 28 219 28 193 Q 28 168 47 148 Q 55 140 66 135 Q 54 98 81 69 L 81 69 Z M 160 125 L 160 125 L 138 103 Q 126 93 115 103 Q 106 114 115 125 L 138 148 L 138 148 L 234 244 Q 248 261 234 278 Q 217 292 200 278 L 104 182 L 104 182 Q 92 172 81 182 Q 72 193 81 204 L 121 244 L 121 244 L 177 301 Q 191 318 177 335 Q 160 349 143 335 L 92 284 L 92 284 Q 81 274 70 284 Q 60 295 70 306 L 183 420 Q 228 463 290 464 L 297 464 L 297 464 L 298 464 L 298 464 Q 361 462 404 420 Q 446 378 449 314 Q 449 313 449 311 Q 449 308 449 306 L 449 148 Q 448 133 433 132 Q 418 133 417 148 L 417 211 Q 416 227 402 233 Q 387 239 376 228 L 217 69 Q 206 59 194 69 Q 185 80 194 91 L 290 188 Q 304 205 290 221 Q 273 235 256 221 L 160 125 L 160 125 Z M 15 368 Q 29 367 33 382 L 34 390 Q 41 424 75 431 L 83 432 Q 97 436 97 450 Q 93 465 79 464 L 70 463 Q 43 458 25 440 Q 7 422 2 395 L 1 386 Q 0 372 15 368 L 15 368 Z" />
          </svg>
        </div>
      </li>
      <li className={`flex w-full items-center after:content-[''] after:w-full after:h-1 after:border-b after:border-4 after:inline-block ${step <= 2 ? "after:border-gray-100" : "after:border-blue-100"}`}>
        <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 ${step >= 1 ? "bg-blue-100" : "bg-gray-100"}`}>
          <svg className={`w-4 h-4 lg:w-6 lg:h-6 ${step >= 1 ? "text-blue-600" : "text-gray-600"}`} xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 512 512">
            <path d="M 464 256 Q 464 199 436 152 L 436 152 Q 409 105 360 76 Q 311 48 256 48 Q 201 48 152 76 Q 103 105 76 152 Q 48 199 48 256 Q 48 313 76 360 Q 103 407 152 436 Q 201 464 256 464 Q 311 464 360 436 Q 409 407 436 360 Q 464 313 464 256 L 464 256 Z M 0 256 Q 1 186 34 128 L 34 128 Q 68 70 128 34 Q 189 0 256 0 Q 323 0 384 34 Q 444 70 478 128 Q 511 186 512 256 Q 511 326 478 384 Q 444 442 384 478 Q 323 512 256 512 Q 189 512 128 478 Q 68 442 34 384 Q 1 326 0 256 L 0 256 Z M 268 131 Q 280 138 280 152 L 280 336 L 320 336 Q 342 338 344 360 Q 342 382 320 384 L 256 384 L 192 384 Q 170 382 168 360 Q 170 338 192 336 L 232 336 L 232 193 L 212 205 Q 192 214 179 196 Q 170 176 188 163 L 244 131 Q 256 125 268 131 L 268 131 Z" />
          </svg>
        </div>
      </li>
      <li className={`flex w-full items-center after:content-[''] after:w-full after:h-1 after:border-b after:border-4 after:inline-block ${step <= 3 ? "after:border-gray-100" : "after:border-blue-100"}`}>
        <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 ${step >= 3 ? "bg-blue-100" : "bg-gray-100"}`}>
          <svg className={`w-4 h-4 lg:w-6 lg:h-6 ${step >= 3 ? "text-blue-600" : "text-gray-600"}`} xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 512 512">
            <path d="M 256 48 Q 313 48 360 76 L 360 76 Q 407 103 436 152 Q 464 201 464 256 Q 464 311 436 360 Q 407 409 360 436 Q 313 464 256 464 Q 199 464 152 436 Q 105 409 76 360 Q 48 311 48 256 Q 48 201 76 152 Q 105 103 152 76 Q 199 48 256 48 L 256 48 Z M 256 512 Q 326 511 384 478 L 384 478 Q 442 444 478 384 Q 512 323 512 256 Q 512 189 478 128 Q 442 68 384 34 Q 326 1 256 0 Q 186 1 128 34 Q 70 68 34 128 Q 0 189 0 256 Q 0 323 34 384 Q 70 444 128 478 Q 186 511 256 512 L 256 512 Z M 223 185 Q 234 176 248 176 L 251 177 Q 267 177 277 188 Q 288 198 288 214 Q 288 230 276 241 L 168 343 Q 157 354 162 369 Q 168 383 184 384 L 328 384 Q 350 382 352 360 Q 350 338 328 336 L 245 336 L 309 276 Q 335 250 336 214 Q 335 178 312 154 Q 288 130 252 128 L 249 128 Q 218 128 194 146 L 170 165 Q 153 180 165 198 Q 180 215 199 203 L 223 185 L 223 185 Z" />
          </svg>
        </div>
      </li>
      <li className={`flex w-full items-center after:content-[''] after:w-full after:h-1 after:border-b after:border-4 after:inline-block ${step <= 4 ? "after:border-gray-100" : "after:border-blue-100"}`}>
        <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 ${step >= 4 ? "bg-blue-100" : "bg-gray-100"}`}>
          <svg className={`w-4 h-4 lg:w-6 lg:h-6 ${step >= 4 ? "text-blue-600" : "text-gray-600"}`} xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 512 512">
            <path d="M 256 48 Q 313 48 360 76 L 360 76 Q 407 103 436 152 Q 464 201 464 256 Q 464 311 436 360 Q 407 409 360 436 Q 313 464 256 464 Q 199 464 152 436 Q 105 409 76 360 Q 48 311 48 256 Q 48 201 76 152 Q 105 103 152 76 Q 199 48 256 48 L 256 48 Z M 256 512 Q 326 511 384 478 L 384 478 Q 442 444 478 384 Q 512 323 512 256 Q 512 189 478 128 Q 442 68 384 34 Q 326 1 256 0 Q 186 1 128 34 Q 70 68 34 128 Q 0 189 0 256 Q 0 323 34 384 Q 70 444 128 478 Q 186 511 256 512 L 256 512 Z M 184 128 Q 162 130 160 152 Q 162 174 184 176 L 250 176 L 200 222 Q 189 234 194 249 Q 200 263 216 264 L 268 264 Q 283 264 293 274 Q 304 284 304 300 Q 304 315 294 326 Q 283 336 268 336 L 240 336 Q 219 335 207 318 L 204 314 Q 191 296 171 306 Q 154 319 164 339 L 166 343 Q 192 383 240 384 L 268 384 Q 304 383 327 359 Q 351 336 352 300 Q 351 267 330 244 Q 310 220 277 216 L 328 170 Q 339 158 334 143 Q 328 129 312 128 L 184 128 L 184 128 Z" />
          </svg>
        </div>
      </li>
      <li className={`flex w-full items-center after:content-[''] after:w-full after:h-1 after:border-b after:border-4 after:inline-block ${step <= 5 ? "after:border-gray-100" : "after:border-blue-100"}`}>
        <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 ${step >= 5 ? "bg-blue-100" : "bg-gray-100"}`}>
          <svg className={`w-4 h-4 lg:w-6 lg:h-6 ${step >= 5 ? "text-blue-600" : "text-gray-600"}`} xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 512 512">
            <path d="M 464 256 Q 464 199 436 152 L 436 152 Q 409 105 360 76 Q 311 48 256 48 Q 201 48 152 76 Q 103 105 76 152 Q 48 199 48 256 Q 48 313 76 360 Q 103 407 152 436 Q 201 464 256 464 Q 311 464 360 436 Q 409 407 436 360 Q 464 313 464 256 L 464 256 Z M 0 256 Q 1 186 34 128 L 34 128 Q 68 70 128 34 Q 189 0 256 0 Q 323 0 384 34 Q 444 70 478 128 Q 511 186 512 256 Q 511 326 478 384 Q 444 442 384 478 Q 323 512 256 512 Q 189 512 128 478 Q 68 442 34 384 Q 1 326 0 256 L 0 256 Z M 224 129 Q 244 138 239 160 L 201 272 L 272 272 L 272 216 Q 274 194 296 192 Q 318 194 320 216 L 320 272 L 328 272 Q 350 274 352 296 Q 350 318 328 320 L 320 320 L 320 360 Q 318 382 296 384 Q 274 382 272 360 L 272 320 L 168 320 Q 156 320 149 310 Q 142 300 145 288 L 193 144 Q 202 124 224 129 L 224 129 Z" />
          </svg>
        </div>
      </li>
      <li className="flex items-center after:w-full">
          <div className={`flex items-center justify-center w-10 h-10 rounded-full lg:h-12 lg:w-12 shrink-0 ${step >= 6 ? "bg-blue-100" : "bg-gray-100"}`}>
            <svg className={`w-4 h-4 lg:w-6 lg:h-6 ${step === 6 ? "text-blue-600" : "text-gray-600"}`} aria-hidden="true" xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 18 20">
                <path d="M16 1h-3.278A1.992 1.992 0 0 0 11 0H7a1.993 1.993 0 0 0-1.722 1H2a2 2 0 0 0-2 2v15a2 2 0 0 0 2 2h14a2 2 0 0 0 2-2V3a2 2 0 0 0-2-2ZM7 2h4v3H7V2Zm5.7 8.289-3.975 3.857a1 1 0 0 1-1.393 0L5.3 12.182a1.002 1.002 0 1 1 1.4-1.436l1.328 1.289 3.28-3.181a1 1 0 1 1 1.392 1.435Z"/>
            </svg>
          </div>
      </li>
    </ol>
    <form
        data-netlify = "true"
        netlify-honeypot = "bot-field"
        name="survey"
        method="POST"
        action="/success"
      >
        <p className="hidden">
          <label>
            Don’t fill this out if you’re human: <input name="bot-field" />
          </label>
        </p>
        <input type="hidden" name="form-name" value="survey" />
          <div className="py-4">      
          {/* Step 1 Form */}
            <div className={step !== 0 ? "hidden" : ""}>
              <h2 className="text-center">Welcome to the IANUS Case Studies</h2>
              <p className="text-center py-2">Before we start we'd like you to fill in your given user ID and answer the following questionnaires.</p>
              <div className="pt-4">
                <label htmlFor="name"><strong>User ID</strong></label>
                <input 
                required
                value={formData.user_id} 
                id="user_id" 
                type="text" 
                name="user_id" 
                onChange={e => setFormData({...formData, user_id: e.target.value})}
                className="bg-gray-50 border border-gray-300 text-gray-900 text-sm rounded-lg focus:ring-blue-600 focus:border-blue-600 block w-full p-2.5" 
                />
              </div>
              <div className="py-2 text-center mt-10">
                <a href="" target="_blank" className="mx-2"><span className="btn rounded-full my-2 md:my-0 w-full md:w-fit bg-amber-700 text-white hover:bg-amber-800">Consent Form</span></a>
                <a href="" target="_blank" className="mx-2"><span className="btn rounded-full my-2 md:my-0 w-full md:w-fit bg-amber-700 text-white hover:bg-amber-800">Pre-study Surveys</span></a>
              </div>
            </div>
            {/* Step 2 Form */}         
            <div className={step !== 1 ? "hidden" : ""}>
              <h2 className="text-center">Task 1</h2>
              <p className="text-left py-2">Lorem ipsum dolor sit amet consectetur adipisicing elit. Ad ea labore, ullam eius facilis at fugit. Officiis molestiae impedit voluptas similique ad quidem, quas hic praesentium illum excepturi, eveniet, eum assumenda laboriosam nam. Quis, animi. Repellendus ab corrupti beatae aliquam, veritatis exercitationem natus aut dolore tempora consequuntur dignissimos nam laboriosam.</p>
              <div className="py-4" ref={zoomable_treemapRef} />
              <hr className="mt-5" />
              <p className="text-center pt-5">Do you find the above analysis sufficient or would like to read the speech yourself?</p>
              <Dialog.Root className="fixed inset-0 z-10 overflow-y-auto">
                <div className="py-2 text-center mt-10 ">
                  <Dialog.Trigger className="btn rounded-full my-2 md:my-0 w-full md:w-fit bg-amber-700 text-white hover:bg-amber-800">
                    Read the speech
                  </Dialog.Trigger>
                </div>
                <Dialog.Portal>
                  <Dialog.Overlay className="data-[state=open]:animate-overlayShow inset-0 w-full h-auto bg-black opacity-40" />
                  <Dialog.Content className="fixed top-[50%] left-[50%] translate-x-[-50%] translate-y-[-50%] w-full h-4/6 max-w-4xl mx-auto px-4 overflow-y-scroll">
                    <div className="bg-white rounded-md shadow-lg px-4 py-6">
                      <div className="flex items-center justify-end">
                        <Dialog.Close className="p-2 text-gray-400 rounded-md hover:bg-gray-100">
                          <svg
                            xmlns="http://www.w3.org/2000/svg"
                            className="w-5 h-5 mx-auto"
                            viewBox="0 0 20 20"
                            fill="currentColor"
                          >
                            <path
                              fillRule="evenodd"
                              d="M4.293 4.293a1 1 0 011.414 0L10 8.586l4.293-4.293a1 1 0 111.414 1.414L11.414 10l4.293 4.293a1 1 0 01-1.414 1.414L10 11.414l-4.293 4.293a1 1 0 01-1.414-1.414L8.586 10 4.293 5.707a1 1 0 010-1.414z"
                              clipRule="evenodd"
                            />
                          </svg>
                        </Dialog.Close>
                      </div>
                      <div className="max-w-4xl mx-auto space-y-3 text-center ">
                        <Dialog.Title className="text-lg font-medium text-gray-800 ">
                          Speech in greek
                        </Dialog.Title>

                        <Dialog.Description className="text-sm text-gray-600 text-left px-5">
                          <p className="py-1">Νεοδημοκράτισσες και Νεοδημοκράτες, συναγωνιστές της Θεσσαλονίκης, περήφανοι Μακεδόνες. 
                            Κύριε Περιφερειάρχα, κ. Δήμαρχε, σας ευχαριστώ γι’ αυτή την εντυπωσιακή υποδοχή. Σας 
                            ευχαριστώ πρωτίστως για την εντυπωσιακή νίκη που δώσατε στη Νέα Δημοκρατία στις 21 Μαΐου 
                            εδώ, στη νέα ιδιαίτερη εκλογική μου περιφέρεια, στην Α΄ Θεσσαλονίκης, αλλά και σε όλη τη 
                            Μακεδονία.Πρέπει να σας πω ότι νιώθω σήμερα συγκίνηση και τιμή να μιλάω κάτω από το μνημείο
                            του Μεγάλου Αλεξάνδρου. Ένα μεγάλο ευχαριστώ στην ΟΝΝΕΔ μας, στις ΟΝΝΕΔίτισσες και στους 
                            ΟΝΝΕΔίτες, που πάντα δίνουν το δικό τους ξεχωριστό στίγμα σε όλες μας τις συγκεντρώσεις. 
                            Εμείς οι παλαιότεροι θυμόμαστε ότι η Πλατεία Αριστοτέλους, η παραλία της Θεσσαλονίκης, 
                            έχει φιλοξενήσει ιστορικές συγκεντρώσεις της παράταξής μας. Πρώτα με τον ιδρυτή της 
                            Κωνσταντίνο Καραμανλή, αργότερα με τον Κωνσταντίνο Μητσοτάκη, τον Κώστα Καραμανλή, τον 
                            Αντώνη Σαμαρά. Μπορεί να ήταν άλλες εποχές, αλλά το πάθος για την πατρίδα και την προκοπή 
                            μένει πάντα το ίδιο. Το αποδείξατε, ήδη, στην πρώτη κάλπη. Ένα μεγάλο ευχαριστώ στα 2,4 
                            εκατομμύρια Ελληνίδες και Έλληνες που μας εμπιστεύθηκαν.
                          </p>
                          <p className="py-1">Την 21η Μαΐου οι πολίτες επιβράβευσαν τη δουλειά μας, λέγοντας «ναι» στην αλήθεια, «ναι» 
                            στην ενότητα, «ναι» στην ευπρέπεια του πολιτικού λόγου. Αλλά και τιμωρώντας αυτούς που 
                            επένδυσαν στον διχασμό, στο ψέμα, στο «μαύρο» και στην τοξικότητα. Διότι όσο ισχυρή κι αν 
                            ήταν η επιβράβευση των πολιτών τον Μάιο, άλλο τόσο ήταν και ισχυρό το αίτημα να προχωρήσουμε
                            πιο γρήγορα, πιο τολμηρά στο δρόμο των μεγάλων αλλαγών, των μεγάλων μεταρρυθμίσεων που έχει 
                            ανάγκη η πατρίδα μας.Είμαστε, λοιπόν, όλες και όλοι σήμερα εδώ, σε αυτή την πολύ όμορφη μεγάλη
                            συγκέντρωση, για να στείλουμε ένα μήνυμα: για να γίνει η νίκη πραγματικότητα πρέπει να 
                            επαναληφθεί μεγαλύτερη την Κυριακή που έρχεται.
                          </p>
                          <p className="py-1">Γιατί, προσέξτε, τίποτα δεν έχει κριθεί ακόμα. Κάναμε πράγματι ένα μεγάλο βήμα. Βήμα, 
                            ωστόσο, που θα είναι σαν να μην έγινε ποτέ εάν δεν εδραιωθεί για να μετατραπεί αμέσως μετά,
                            στις 26 Ιουνίου, σε άλμα ολόκληρης της χώρας.Με έχετε ακούσει πολλές φορές να το λέω: 
                            το πρωί της 25ης Ιουνίου οι κάλπες θα είναι και πάλι άδειες. Για να έχουμε σταθερή και 
                            ισχυρή κυβέρνηση στις 26 Ιουνίου πρέπει και πάλι να γεμίσουν, να πλημμυρίσουν με 
                            εκατομμύρια ψηφοδέλτια της παράταξής μας.Μόνο τότε η επόμενη μέρα θα φέρει σιγουριά στον 
                            τόπο. Και μόνο με αυτό τον τρόπο το τιμόνι του θα το κρατάει τελικά η μόνη πολιτική δύναμη
                            που έχει δείξει ότι μπορεί να ξεπερνά τις κρίσεις, υλοποιώντας ταυτόχρονα και όλες τις 
                            δεσμεύσεις της απέναντι στους πολίτες.Αυτό το στοίχημα γίνεται διπλό, ειδικά εδώ, στην Α’,
                            στη Β’ Περιφέρεια Θεσσαλονίκης, όπου τα ποσοστά μας έχουν ακόμα πολλά περιθώρια ανόδου.
                          </p>
                          <p className="py-1">Δικό σας καθήκον, συνεπώς, είναι να έρθουμε όχι απλά πρώτοι αλλά πρώτοι και με μεγάλη 
                            διαφορά, εδώ, στη Θεσσαλονίκη.Με άλλα λόγια, ήρθε η στιγμή να βάλουμε τα πράγματα στη θέση
                            τους και να βάλουμε και αυτή την πόλη στη θέση που της αξίζει: προπύργιο της εθνικής 
                            παράδοσης και παράλληλα φάρος διαρκούς εξέλιξης.Η Θεσσαλονίκη είναι το απόρθητο κάστρο της
                            αυτοδύναμης και παντοδύναμης Ελλάδος.Είμαστε, εξάλλου, σε ένα τόπο που ξέρει να διακρίνει
                            κάθε φορά τις κρίσιμες αναγκαιότητες. Οι Μακεδόνες, όπως και όλες οι Ελληνίδες και όλοι 
                            οι Έλληνες, εξουδετέρωσαν με την απλή λογική την παγίδα της απλής αναλογικής.Είμαι 
                            βέβαιος ότι με την ίδια ωριμότητα σε λίγες μέρες από τώρα θα ζυγίσουν και το βάρος της 
                            νέας τους ψήφου, γνωρίζοντας ότι αυτή θα προσφέρει ασφάλεια στην αυριανή μας 
                            καθημερινότητα και ότι αυτή, επίσης, θα δώσει ώθηση στην αισιοδοξία για μία καλύτερη ζωή.
                          </p>
                          <p className="py-1">Φίλες και φίλοι, το ξέρετε καλά, η αριθμητική της κάλπης είναι αμείλικτη. Πολλές ακραίες 
                            φωνές στη Βουλή δεν σημαίνουν κατ’ ανάγκη πολυφωνία αλλά ίσως το αντίθετο, να οδηγηθούμε σε
                            μία δημοκρατική «κακοφωνία», ένα φρένο στο αποτέλεσμα και στη δημιουργία και έναν κίνδυνο 
                            στην ακυβερνησία.Είναι περιπέτειες που τις έχει ζήσει η πατρίδα μας και θέλει πια οριστικά
                            να τις αφήσει πίσω. Πολύ περισσότερο όταν τις εκφράζουν νεόκοποι «ηγέτες», προσωποπαγή 
                            σχήματα που νοθεύουν τελικά τις ιδέες που επικαλούνται.Η καπηλεία των αξιών, μάλιστα, 
                            αποτελεί το κοινό σημείο αυτών των κινήσεων, είτε πρόκειται για τη δήθεν φιλοπατρία ή για
                            το μονοπώλιο της ορθοδοξίας. Αυτά είναι μεγέθη που ενώνουν και δεν χωρίζουν. Η ορθοδοξία
                            είναι πολύ μεγάλη για να φυλακίζεται μέσα σε συνθήματα.Όσοι, λοιπόν, με τη συμπεριφορά
                            τους τελικά προσβάλλουν τον σταυρό ή τη γαλανόλευκη, ας το ακούσουν καλά: αρκετά με 
                            τους ντεμέκ πιστούς και τους ντεμέκ πατριώτες. Οι πρώτοι φτάνουν να εμπορεύονται μέχρι
                            και τη θρησκεία. Πού; Εδώ, μέσα στην πόλη - καμάρι του Βυζαντίου. Ενώ άλλοι τολμούν 
                            να μονοπωλούν την εθνική συνείδηση.Απέναντι σε ποιους τα λένε αυτά; Σε εσάς, στους 
                            Μακεδόνες της πρώτης γραμμής. Και πότε τα λένε; Σήμερα, μου θύμισαν, 110 χρόνια 
                            ακριβώς από τη μάχη του Κιλκίς - Λαχανά, είμαι εδώ για να μιλήσω για τον πατριωτισμό
                            της ευθύνης.
                          </p>
                          <p className="py-1">Είμαι εδώ, διαρκώς παρών σε όλα τα μέτωπα, στα σύνορα, στο Αιγαίο, στις Ένοπλες Δυνάμεις
                            αλλά και με ηχηρή διπλωματική φωνή σε κάθε διεθνές βήμα. Οι Έλληνες δεν βλέπουν σε αυτόν
                            τον πατριωτισμό ένα φθηνό νόμισμα το οποίο εξαργυρώνεται στις εκλογές, αλλά ένα βαθύ
                            αίσθημα που δοκιμάζεται σε έργα και συμπεριφορές. Αναγνωρίζουν σε μας, τη Νέα 
                            Δημοκρατία, ότι εμείς κάναμε την πατρίδα πιο ισχυρή και πιο ασφαλή με έργα και όχι με
                            λόγια του αέρα.Και θα το ξαναπώ: στις 21 Μαΐου ψηφίσαμε για να νικήσουμε μαζί, αλλά 
                            στις 25 Ιουνίου ψηφίζουμε για να κυβερνήσουμε μαζί.
                          </p>
                          <p className="py-1">Στις 21 Μαΐου επιβραβεύσαμε μια πολιτική που μείωσε 50 φόρους, που αύξησε το εισόδημα
                            και τις συντάξεις. Μια πολιτική που δημιούργησε 300.000 νέες θέσεις εργασίας. Ενώ τώρα
                            σχεδιάζουμε καλύτερους μισθούς για όλους, μία καλύτερη δημόσια υγεία, ένα κράτος πιο
                            φιλικό, πιο αποτελεσματικό, στην υπηρεσία όλων.Είναι στόχοι με ξεχωριστή σημασία στο
                            δρόμο για την πολυπόθητη επενδυτική βαθμίδα. Έχω μιλήσει πολύ γι’ αυτό. Ένα πολύ 
                            σημαντικό ορόσημο που θα κάνει ευνοϊκότερο τον δανεισμό επιχειρήσεων και νοικοκυριών.
                          </p>
                          <p className="py-1">Όμως, το ξέρετε, δεν θα λείψουν οι επικίνδυνες προκλήσεις την επόμενη τετραετία. Το 
                            μεταναστευτικό, το είδατε, ξαναφουντώνει. Όπως και μια απρόβλεπτη Τουρκία, ένας γείτονας 
                            που θυμίζω ότι σήμερα πια διαθέτει σταθερή ηγεσία. Η ελληνική απάντηση, λοιπόν, θα πρέπει 
                            να είναι με τη σειρά της μία επιλογή εθνικής σιγουριάς και εθνικής προκοπής.Οδηγός στον 
                            δρόμο μας θα είναι η αξιοπιστία και η εμπιστοσύνη που θεμελιώσαμε μεταξύ μας. Όπως την 
                            πρώτη θητεία κάναμε όσα είπαμε, έτσι θα υλοποιήσουμε και αύριο αυτά που σχεδιάζουμε σήμερα. 
                            Είναι δέσμευσή μου. Θα το κάνουμε όπως το κάναμε εδώ και τέσσερα χρόνια, χωρίς να κρύβουμε 
                            λάθη και αδυναμίες. Έχοντας όμως, πια, μεγαλύτερη πείρα, μεγαλύτερη ορμή. Ορμή που θα 
                            αυξάνεται όσο πιο ισχυρή είναι η δική σας εντολή. Γι’ αυτό και επιμένω ότι η αυτοδύναμη Νέα 
                            Δημοκρατία είναι ο μόνος δρόμος που οδηγεί τελικά σε μια ισχυρή Ελλάδα.
                          </p>
                          <p className="py-1">Φίλες και φίλοι, συναγωνιστές της Νέας Δημοκρατίας στη Θεσσαλονίκη, μαζί ζήσαμε και 
                            ξεπεράσαμε την περασμένη τετραετία πολλές απανωτές κρίσεις. Μεταναστευτικές εισβολές στον 
                            Έβρο, μια σχεδόν τριετή πανδημία, διεθνή ενεργειακή κρίση, ακρίβεια. Καθημερινά προβλήματα, 
                            εθνικά στοιχήματα. Είδατε ότι η πολιτεία όχι μόνο κράτησε όρθιες την κοινωνία και την οικονομία,
                            αλλά υλοποίησε όλα όσα είχε υποσχεθεί, θωρακίζοντας όσο ποτέ την εθνική μας άμυνα.Ελαφρύνοντας 
                            τους φορολογούμενους από ετήσια βάρη 7 δισεκατομμυρίων, μειώνοντας την ανεργία κατά σχεδόν 7 
                            μονάδες, στηρίζοντας πάντα τους πιο αδύναμους, επιταχύνοντας -τα λέω αυτά για τους συνταξιούχους
                            μας- το χρόνο απονομής των συντάξεων. Γνωρίζετε πολύ καλά ότι όταν αναλάβαμε την κυβέρνηση 
                            χρειάζονταν δύο, τρία, τέσσερα χρόνια να βγει μία σύνταξη. Σήμερα, ναι, οι συντάξεις βγαίνουν σε
                            δύο έως τρεις μήνες και αυτό είναι μία επιτυχία της Νέας Δημοκρατίας.Εμείς είμαστε αυτοί που 
                            δώσαμε για πρώτη φορά σημαντικές αυξήσεις στους συνταξιούχους. Και η δική μας κυβέρνηση, αυτές
                            τις αυξήσεις του 8% τις συνόδευσε με τη ρητή δέσμευση να αντιμετωπίσει τον τραγέλαφο της 
                            προσωπικής διαφοράς. Είμαι εδώ για να διαβεβαιώσω για ακόμα μία φορά τους συνταξιούχους που δεν
                            είδαν αύξηση λόγω της προσωπικής διαφοράς, ότι θα έχουν τη στήριξη του κράτους έως ότου η 
                            προσωπική διαφορά σβήσει οριστικά.
                          </p>
                          <p className="py-1">Η κάλπη της 21ης Μαΐου έδειξε ότι δίπλα μας στοιχίζονται όλες οι κοινωνικές, όλες οι 
                            δημογραφικές ομάδες. Οι νέοι μας. Τι βλέπουν οι νέοι μας; Γιατί ψήφισαν οι νέοι τη Νέα 
                            Δημοκρατία κόντρα σε όλες τις προβλέψεις; Γιατί εσείς αναγνωρίσατε ότι μόνο οι ποιοτικές
                            σπουδές και η κατάρτιση οδηγούν τελικά σε ένα ασφαλές επάγγελμα και στηρίξατε μία 
                            κυβέρνηση που είναι με τις βιβλιοθήκες και όχι με τις βαριοπούλες, τους μπαχαλάκηδες και
                            τους καταληψίες.Οι άνεργοι μας στήριξαν διότι αντελήφθησαν ότι τελικά μόνο οι επενδύσεις
                            ανοίγουν νέες δουλειές. Οι μισθωτοί συνειδητοποιούν ότι τελικά είναι η συλλογική ανάπτυξη
                            αυτή που φέρνει αυξήσεις. Οι επαγγελματίες ότι τελικά λιγότεροι φόροι σημαίνουν 
                            περισσότερα έσοδα. Οι αγρότες μας διαπιστώνουν ότι μόνο η μείωση της φορολογίας, τα 
                            κίνητρα για τον εκσυγχρονισμό της παραγωγής, τελικά στηρίζουν το εισόδημά τους. Αισθάνομαι
                            ότι με μία πρωτοφανή -θα έλεγα- ωριμότητα, οι Ελληνίδες και οι Έλληνες μας καλούν να
                            προχωρήσουμε όπως λέει το σύνθημά μας: «σταθερά, τολμηρά και μόνο μπροστά». Να κάνουμε 
                            προτεραιότητες τις ελλείψεις που υπάρχουν ακόμα.Για να γίνει αυτό το οποίο φωνάζετε, πρέπει 
                            στις 25 Ιουνίου όλες και όλοι να πάμε να ψηφίσουμε και το μήνυμα της κάλπης να είναι ηχηρό.
                          </p>
                          <p className="py-1">Καθώς λοιπόν -όπως ελπίζω- τα πολύ δύσκολα φαίνονται πια πίσω μας, ήρθε η ώρα να σηκώσουμε τα 
                            μανίκια για την τετραετία που θέλουμε.Αναρωτιέμαι πόσοι θα στοιχημάτιζαν πριν την 21η Μαΐου ότι όλη
                            η Ελλάδα θα ήταν μπλε. Κι όμως το πετύχαμε. Τώρα ήρθε η ώρα αυτή την εμπιστοσύνη των πολιτών σε 
                            αυτή τη γαλάζια πατρίδα να την ανταποδώσουμε, εφαρμόζοντας το πρόγραμμα μίας Ελλάδας παραγωγικής,
                            κοινωνικής, δίκαιης, ψηφιακής, πάντα ισχυρής. Αυτό είναι το κοστολογημένο σχέδιο που αυτές τις 
                            εβδομάδες το συζητήσαμε πάλι. Ξαναγύρισα την Ελλάδα πόλη-πόλη, χωριό-χωριό, για να μεταφέρω το
                            μήνυμα ότι μπορούμε καλύτερα, ότι αξίζουμε καλύτερα και μπορούμε να πετύχουμε αυτούς τους στόχους
                            που έχουμε στο πρόγραμμά μας.
                          </p>
                          <p className="py-1">Τους συνοψίσαμε σε τέσσερις βασικούς στόχους: Καλύτεροι μισθοί πρώτα και πάνω απ’ όλα, η
                            κεντρική μου δέσμευση. Ξέρω ότι οι μισθοί στη χώρα μας είναι ακόμα χαμηλοί, ειδικά για τα
                            νέα παιδιά που μπαίνουν στην αγορά εργασίας. Πρέπει επιτέλους να πλησιάσουν τον ευρωπαϊκό
                            μέσο όρο.Αξιοπρεπής υγεία, δεύτερη προτεραιότητα. Μετά από τρία χρόνια πανδημίας ήρθε η 
                            ώρα να χτίσουμε το νέο ΕΣΥ. Ένα αποτελεσματικό κράτος, ψηφιακό, αλλά και φιλικό.Και φυσικά
                            μία σταθερά περήφανη πατρίδα.
                          </p>
                          <p className="py-1">Περιγράφω σύντομα τους στόχους. Πρώτος στόχος, όπως είπα, οι καλύτερες αμοιβές. Μέσα στην
                            τετραετία ο μέσος μισθός στον ιδιωτικό τομέα θα φτάσει στα 1.500 ευρώ και ο βασικός μισθός
                            στα 950 ευρώ.Οι δημόσιοι υπάλληλοι θα δουν για πρώτη φορά αυξήσεις το 2024, με έμφαση στους
                            δημοσίους υπαλλήλους με παιδιά, διότι εμείς είμαστε η παράταξη που στηρίζει την ελληνική 
                            οικογένεια. Γι’ αυτό και φέρνουμε πρόσθετο αφορολόγητο 1.000 ευρώ για οικογένειες με παιδιά.
                            Γι’ αυτό θα μειώσουμε τα τεκμήρια διαβίωσης, γι’ αυτό θα μειώσουμε κι άλλο τις ασφαλιστικές
                            εισφορές. Και, φυσικά, όσο βελτιώνεται η φορολογική συμμόρφωση θα καταργήσουμε και το τέλος
                            επιτηδεύματος.
                          </p>
                          <p className="py-1">Ο δεύτερος στόχος για την υγεία. Με έχετε ακούσει πολλές φορές να μιλώ 
                            για την ανάγκη να αναβαθμίσουμε τα τμήματα επειγόντων περιστατικών, 156 κέντρα υγείας θα 
                            ξαναφτιαχτούν. Και κυρίως, το σημαντικότερο, να μειωθεί δραστικά η αναμονή, είτε μιλάμε για 
                            τα επείγοντα περιστατικά, είτε μιλάμε για τακτικά χειρουργεία.Ναι, θα κάνουμε 10.000 προσλήψεις
                            στην υγεία, γιατρούς, νοσηλευτές, οι 1.000 από τις οποίες θα είναι στο ΕΚΑΒ. Το οποίο ΕΚΑΒ θα
                            ενισχυθεί και με τη συμμετοχή του προσωπικού των Ενόπλων Δυνάμεων, της Πυροσβεστικής, με έξι
                            βάσεις ελικοπτέρων για αεροδιακομιδές. Δίνω μεγάλη έμφαση στις προληπτικές εξετάσεις, που 
                            επεκτείνονται για όλα τα βασικά νοσήματα.
                          </p>
                          <p className="py-1">Τρίτος στόχος: ένα κράτος -όπως αποδείξαμε ότι μπορεί να το κάνει- δίπλα
                            στους πιο ευάλωτους. Με το Ελάχιστο Εγγυημένο Εισόδημα να αυξάνεται, με 2.000 πολίτες μας με
                            αναπηρία να έχουν επιτέλους Προσωπικό Βοηθό. Αλλά ένα κράτος με στελέχη που θα αξιολογούνται
                            συνεχώς, έτσι ώστε να μπορούν να επιβραβεύονται για τις επιδόσεις τους.Ο τελικός μας στόχος,
                            ναι, ένα καλύτερο Δημόσιο. Όχι μόνο με δισεκατομμύρια ηλεκτρονικές συναλλαγές αλλά και με 
                            καθημερινές επαγγελματικές, ανθρώπινες συμπεριφορές.
                          </p>
                          <p className="py-1">Και ο τέταρτος στόχος μας, βέβαια, αδιαπραγμάτευτος για την παράταξή μας: η
                            ισχυρή Ελλάδα. Αυτό σημαίνει ότι ο φράχτης στον Έβρο τελειώνει, είτε το θέλουν κάποιοι είτε όχι. 
                            Τα εξοπλιστικά προγράμματα συνεχίζονται με τα Rafale, τις φρεγάτες Belharra και τα πρώτα F-35 
                            στην Πολεμική μας Αεροπορία το 2028.Όπως, βέβαια, θα συνεχιστούν οι μεγάλες ενεργειακές επενδύσεις.
                            Όλες οι πρωτοβουλίες της διπλωματίας μας, σε όλα τα διεθνή πεδία. Ήρθε η ώρα να ξεχωρίσουν οι δήθεν
                            πατριώτες των κούφιων λόγων από τους αληθινούς πατριώτες της πράξης.
                          </p>
                          <p className="py-1">Με την «ομπρέλα» αυτών των τεσσάρων προτεραιοτήτων προωθούνται και τα αναπτυξιακά
                            σχέδια για κάθε περιοχή. Αιχμή, για παράδειγμα, εδώ, στην Κεντρική Μακεδονία, κ. Περιφερειάρχα,  κ. 
                            Δήμαρχε, το πιο όμορφο Μετρό της Ευρώπης, αυτό που σε λίγο θα λειτουργεί κανονικά, όχι με ζωγραφισμένα
                            εκδοτήρια και με ακίνητα βαγόνια. Με γρήγορους και αθόρυβους συρμούς -η νίκη πάντα αρχίζει από την 
                            Θεσσαλονίκη, εμείς οι παλαιότεροι το θυμόμαστε- και αυτό το Μετρό σε ένα μοναδικό περιβάλλον που 
                            ταυτόχρονα αναδεικνύει τους θησαυρούς της πόλης.Και Μετρό και αρχαία, λοιπόν. Το είπαμε και το κάναμε. 
                            Θα έλεγα, μάλιστα, ότι σε αυτό το έργο καταγράφεται και η ιστορία, αποτυπώνεται και η δική μας αντίληψη
                            συνολικά για την πορεία της πόλης. Από τη μία πλευρά οι διαδρομές από τον Μέγα Αλέξανδρο στους 
                            ελληνιστικούς χρόνους, στη ρωμαϊκή περίοδο και στο Βυζάντιο. Και από την άλλη ο συνδυασμός της ιστορίας
                            και της παράδοσης με τα καθημερινά δρομολόγια που θα αλλάξουν όψη στην πόλη και θα την ωθήσουν προς μια
                            σύγχρονη εποχή. Για εμάς δεν υπάρχει συνέχεια στον τόπο χωρίς την παράδοση, ούτε και εξέλιξη χωρίς 
                            σεβασμό στην ιστορική μας συνέχεια.
                          </p>
                          <p className="py-1">Γνωρίζετε, επίσης, ότι στην τελική ευθεία μπαίνει το Flyover. Προχωρούν και άλλες 
                            παρεμβάσεις: ο νέος προβλήτας στο λιμάνι, η αναμόρφωση της Διεθνούς Έκθεσης Θεσσαλονίκης, το Μουσείο 
                            Ολοκαυτώματος, χώροι πρασίνου στα στρατόπεδα Ζιάκα και Μελά. Ειδικά για την υγεία και για τα 14 νοσοκομεία 
                            της Περιφέρειας, όλα εκσυγχρονίζονται και η πόλη αποκτά επιτέλους δύο καινούργια νοσοκομεία: το νέο 
                            Παιδιατρικό και το νέο Αντικαρκινικό της νοσοκομείο, το νέο «Θεαγένειο», στο στρατόπεδο Καρατάσιου. Αυτή είναι
                            μία εικόνα από το αύριο της Θεσσαλονίκης και της Μακεδονίας που  η χώρα σας το οφείλει, εδώ και δεκαετίες.
                          </p>
                          <p className="py-1">Ωστόσο, φίλες και φίλοι, είμαι εδώ και πάλι στη Θεσσαλονίκη, στην τελευταία μου 
                            προεκλογική συγκέντρωση, εδώ, στη Μακεδονία, για να αναδείξω πριν απ’ όλα, για ακόμα μία φορά, τη σημασία 
                            αυτής της νέας κάλπης.Γιατί μπορεί τον Μάιο να «μαύρισαν» τελικά το ψέμα, τον διχασμό, επιλέγοντας την αλήθεια
                            και τον ρεαλισμό, όπως και την ειλικρίνεια, αφού τα λάθη εντοπίζονται και αντιμετωπίζονται μόνο όταν 
                            εντοπίζονται. Όλα όμως αυτά, θα το ξαναπώ, ήταν μόνο μηνύματα. Θα αποτελέσουν γεγονότα μόνο όταν ξαναγίνουν 
                            ψήφοι στην κάλπη.Γι’ αυτό και αντίπαλός μας είναι ο εφησυχασμός. Αντίπαλός μας πάντα είναι η αλαζονεία, είναι
                            η αυταρέσκεια, την οποία και δεν πρόκειται να επιτρέψω.Όσο μεγαλύτερη είναι η ευθύνη που εναποθέτουν οι 
                            πολίτες στις πλάτες μας, τόσο έχουμε υποχρέωση να είμαστε σεμνοί, να πατάμε γερά στα πόδια, να ακούμε την 
                            κοινωνία και να δουλέψουμε ακόμα πιο σκληρά για να λύνουμε τα δικά σας προβλήματα.
                          </p>
                          <p className="py-1">Δεν θα πάψω, λοιπόν, να υποστηρίζω ότι στις 26 Ιουνίου η πατρίδα δεν έχει
                            ανάγκη μόνο από μία σταθερή κυβέρνηση, αλλά από μία κυβέρνηση πρωτίστως ικανή να εφαρμόσει το
                            σχέδιό της.Γι’ αυτό και λέω ότι η αυτοδυναμία δεν είναι κομματική σκοπιμότητα. Είναι σήμερα 
                            εθνική αναγκαιότητα. Άλλωστε, το ξέρουμε καλά, μόνο οι μεγάλες πλειοψηφίες πολιτών μπορούν να
                            γίνουν τελικά τα κύματα των μεγάλων αλλαγών που χρειάζεται η χώρα.Δεν πρόκειται, συνεπώς, για
                            λευκή επιταγή, όπως διαλαλούν κάποιοι, αλλά, όπως σας είπα, για μια βαριά εντολή. Είναι μια
                            εντολή χρέους και μια εντολή δουλειάς.Επαναλαμβάνω ότι στις δημοκρατίες οι ισχυρές κυβερνήσεις
                            δεν ταυτίζονται με τις ανεξέλεγκτες κυβερνήσεις. Και άλλοτε είχαμε ηγεσίες με υψηλά ποσοστά, 
                            όμως ποτέ, κανείς, δεν τις παρουσίασε ως φόβητρο.Αλλά και εμείς τέσσερα χρόνια αυτοδύναμη Νέα
                            Δημοκρατία είχαμε. Κι όμως, σε αυτή τη θητεία ψηφίστηκαν 423 νόμοι, έγιναν 718 συζητήσεις 
                            στη Βουλή, 24 συζητήσεις σε επίπεδο αρχηγών.Παντοδύναμος, λοιπόν, είναι μόνο ο ελληνικός λαός.
                            Αυτός θα καθορίσει τελικά τις κοινοβουλευτικές ισορροπίες.
                          </p>
                          <p className="py-1">Αυτό που είναι αλήθεια, όμως, είναι ότι σε ένα αβέβαιο περιβάλλον η χώρα 
                            χρειάζεται βέβαιες λύσεις. Μια κυβέρνηση που δεν θα εξαρτάται από εύθραυστες ισορροπίες, ούτε
                            θα μένει αθωράκιστη σε πιέσεις, σε κομματικά παζάρια, σε συμβιβασμούς, αλλά θα αντλεί, τελικά,
                            ισχύ από τους ίδιους τους πολίτες ώστε να πραγματοποιεί αυτά για τα οποία την εξέλεξαν. Για να
                            έχει, συνεπώς, ο τόπος καθαρό ορίζοντα στην πορεία του, πρέπει να έχει καθαρή λύση στην ηγεσία
                            του. Και αυτή θα την κρίνει μόνο η δική σας ψήφος.Γι’ αυτό και βλέπετε ότι έχω επιλέξει να μην
                            μιλώ πρακτικά καθόλου για τους αντιπάλους μας. Ο κ. Τσίπρας ομολόγησε ο ίδιος την αποτυχία του,
                            εξάλλου, δηλώνοντας «mea culpa».Συνεχίζει, ωστόσο, να αντιγράφει τον κακό του εαυτό. Στο πρόσφατο
                            ναυάγιο ξεχνά ότι έγινε σε διεθνή ύδατα, ξεχνά να πει έστω και μια κουβέντα για το ότι το οργάνωσαν
                            εγκληματίες διακινητές. Και στρέφει και πάλι τα πυρά του εναντίον τίνος; Εναντίον της πατρίδας του,
                            εναντίον του Λιμενικού που έσωσε παραπάνω από 100 ζωές, δίνοντας ταυτόχρονα επιχειρήματα στην Τουρκία
                            να τα χρησιμοποιεί εναντίον της Ελλάδος. Και μετά απορούν γιατί τους αποκαλούμε εθνική εξαίρεση.
                          </p>
                          <p className="py-1">Ενώ δεν θα κουράζομαι να διαψεύδω τα ψέματα που λένε και ξαναλένε περί δήθεν 
                            ιδιωτικοποίησης, πότε της υγείας, πότε του νερού. Εδώ δίπλα δεν είχε γίνει μια μεγάλη συναυλία, στην 
                            Πλατεία Αριστοτέλους, κατά της «ιδιωτικοποίησης του νερού»;Ξεχνούν αυτοί που τη διοργάνωσαν ότι την ΕΥΔΑΠ
                            και την ΕΥΑΘ τις έβαλε στο Υπερταμείο ο ΣΥΡΙΖΑ. Αλλά έναν μήνα μετά τις εκλογές οι δύο αυτές εταιρείες 
                            έρχονται στον έλεγχο του Δημοσίου, για να τελειώσει μια και καλή αυτή η «καραμέλα» περί δήθεν 
                            ιδιωτικοποίησης του νερού.
                          </p>
                          <p className="py-1">Βέβαια και ο κ. Ανδρουλάκης, που αδυνατεί να σηκώσει κάθε βάρος ευθύνης, μας λέει
                            ότι «ακόμα και αν το πρώτο κόμμα έχει 149 βουλευτές» αυτός θα μείνει στην αντιπολίτευση. Θέλει δηλαδή να 
                            γίνει -τι μας λέει;- ΣΥΡΙΖΑ στη θέση του ΣΥΡΙΖΑ, ρισκάροντας ακόμα και τρίτες εκλογές τον Αύγουστο. 
                            Αναρωτιέμαι αν αυτό πραγματικά θέλουν οι φίλοι του ΠΑΣΟΚ.Ωστόσο, την Κυριακή δεν ψηφίζουμε για τον τρίτο 
                            ή τον δεύτερο στη Βουλή. Δεν ψηφίζουμε για αντιπολίτευση, ψηφίζουμε για κυβέρνηση.Ας το σκεφτούν, λοιπόν,
                            αυτό και όσοι δίστασαν τον Μάιο, αλλά θεωρώ ότι τώρα η συνείδησή τους, τους καλεί δίπλα μας. Το ξαναλέω: 
                            κανείς δεν περισσεύει. Πολύ περισσότερο συμπολίτες μας με τις ίδιες αξίες με εμάς, που τώρα τους 
                            πολιορκούν φωνές που καπηλεύονται αυτές τις αξίες, είτε από εκπροσώπους εγκληματιών με αίμα στα χέρια, 
                            είτε από νεόκοπους ψευτοπατριώτες, είτε από ηγετίσκους που επικαλούνται την πίστη της αγάπης αλλά με λόγια
                             μίσους.Όλους αυτούς δεν πρέπει να τους αφήσουμε να γίνουν εστίες μόνιμης ασυνεννοησίας.
                          </p>
                          <p className="py-1">Ένα μήνυμα στους πολίτες, ειδικά, εδώ, στη βόρεια Ελλάδα: δεν δίνουμε αψήφιστα την ψήφο 
                            μας. Όχι πειράματα με το μέλλον της χώρας στην κάλπη της 25ης Ιουνίου.Εγώ θέλω κοντά μου κάθε Ελληνίδα και 
                            κάθε Έλληνα που ζητά σιγουριά και σχέδιο, που ζητά σταθερότητα και αποτελεσματικότητα, που δίχως κομματικές 
                            παρωπίδες πιστεύει στον πατριωτισμό της ευθύνης, στον εκσυγχρονισμό της δημιουργίας.Αν, λοιπόν, την Κυριακή 
                            όλες αυτές οι ψήφοι ευθύνης ενωθούν, τη Δευτέρα το γαλάζιο ψηφοδέλτιο θα μετατραπεί σε μια πολύχρωμη ελπίδα. 
                            Και το βάρος γι’ αυτό πλέον βρίσκεται στα δικά σας χέρια, στη δική σας δύναμη.Η Θεσσαλονίκη, εξάλλου, το ξέρετε
                            καλά, υπήρξε πάντα ένα σταυροδρόμι που ενώνει τη Δύση με την Ανατολή. Είναι ώρα να γίνει πρωταγωνιστής σε μία
                            Ελλάδα που θα τη ζηλεύει όλη η Ευρώπη.Εξάλλου, η απελευθέρωσή της σήμανε ουσιαστικά την αρχή της εθνικής 
                            ολοκλήρωσης τον 20ο αιώνα. Τώρα είναι καιρός η δική της ανάπτυξη να οδηγήσει νικηφόρα και στην τρίτη δεκαετία
                            του 21ου αιώνα. Με άλλα λόγια, η Μακεδονία μπροστά, σημαίνει η πατρίδα μπροστά. Και σε αυτή τη συναρπαστική 
                            πορεία σας ζητώ να ταξιδέψουμε δίπλα-δίπλα.Πάμε λοιπόν. Αγώνας μέχρι και την τελευταία στιγμή πριν την κάλπη,
                            με το βλέμμα ψηλά, με ανοιχτή τη σκέψη, την καρδιά μας, την αγκαλιά μας. Ενωμένοι όσο ποτέ, με ένα μόνο 
                            σύνθημα: την Κυριακή σταθμίζουμε και αποφασίζουμε, στις 25 Ιουνίου ψηφίζουμε, στις 26 σηκώνουμε τα μανίκια,
                            συνεχίζουμε να χτίζουμε τη νέα Ελλάδα που θα προχωρά σταθερά, τολμηρά και μόνο μπροστά.Πάμε μαζί για τη 
                            μεγάλη νίκη.
                          </p>
                        </Dialog.Description>
                      </div>
                    </div>
                  </Dialog.Content>
                </Dialog.Portal>
              </Dialog.Root>          
            </div>  
            <div className={step !== 2 ? "hidden" : ""}>
              <h2>Task 1: Questions</h2>
              <div className="pt-4">
                <div>
                  <label htmlFor="q1"><strong>Question 1: Did you press the button to read the speech?</strong></label>
                  <fieldset className="flex justify-end">
                    <label htmlFor="q1-yes" className="px-2"><strong>Yes</strong></label>
                    <input 
                    required
                    value="Yes"
                    id="q1-yes" 
                    type="radio" 
                    name="q1" 
                    checked={formData.q1 === "Yes"}
                    onChange={e => setFormData({...formData, q1: e.target.value})}
                    className="px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <label htmlFor="q1-no" className="px-2"><strong>No</strong></label>
                    <input 
                    required
                    value="No"
                    id="q1-no" 
                    type="radio" 
                    name="q1" 
                    checked={formData.q1 === "No"}
                    onChange={e => setFormData({...formData, q1: e.target.value})}
                    className="px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                  </fieldset>
                </div>
                <div>
                  <label htmlFor="q2"><strong>Question 2: Why yes/no?</strong></label>
                  <input 
                  value={formData.q2} 
                  id="q2" 
                  type="text" 
                  name="q2" 
                  onChange={e => setFormData({...formData, q2: e.target.value})}
                  className="bg-gray-50 border border-gray-300 text-gray-900 text-sm rounded-lg focus:ring-blue-600 focus:border-blue-600 block w-full p-2.5" 
                  />
                </div>
                <div className="pt-4">
                  <label htmlFor="q3"><strong>Question 3: Did you read the speech (partially or entirely)?</strong></label>
                  <fieldset className="flex justify-end">
                    <label htmlFor="q3-yes" className="px-2"><strong>Yes</strong></label>
                    <input 
                    required
                    value="Yes"
                    id="q3-yes" 
                    type="radio" 
                    name="q3" 
                    checked={formData.q3 === "Yes"}
                    onChange={e => setFormData({...formData, q3: e.target.value})}
                    className="px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <label htmlFor="q3-no" className="px-2"><strong>No</strong></label>
                    <input 
                    required
                    value="No"
                    id="q3-no" 
                    type="radio" 
                    name="q3" 
                    checked={formData.q3 === "No"}
                    onChange={e => setFormData({...formData, q3: e.target.value})}
                    className="px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                  </fieldset>
                </div>
              </div>
            </div>
            {/* Step 3 Form */}    
            <div className={step !== 3 ? "hidden" : ""}>
              <h2 className="text-center">Task 2 - Questions</h2>
              <p className="text-left pt-4">The step charts below depict the evolution of the level of polarization or populism during a political speech, with the number of paragraphs shown on the horizontal axis. Each paragraph, depending on the value of the polarization and populism indicators it has received, is placed in a category:</p>
              <ul className="text-left py-2 list-disc">
                <li>no or low level (polarization or populism respectively) if it has a value from 0 to 0.5,</li>
                <li>medium level if it has a value from 0.51 to 0.8,</li>
                <li>high level if it has a value from 0.81 to 1.</li>
              </ul>
              <p className="text-left py-2">If you wish, hover over the chart to read the corresponding paragraph.</p>
              <div className="grid gap-5 grid-cols-2">
                <div className="col-span-2">
                  <h3 className="text-left py-2 text-lg">First step of the Analysis</h3>
                  <div ref={stepChart2Ref} />
                  <div className="pt-4">
                    <label htmlFor="q4 text-center"><strong>Question 4: I believe the results given in this chart are accurate</strong></label>
                    <fieldset className="flex justify-center py-2">
                      <label htmlFor="q4-1" className="px-2"><strong>Not at all</strong></label>
                      <input 
                      required
                      value="1"
                      id="q4-1" 
                      type="radio" 
                      name="q4" 
                      checked={formData.q4 === "1"}
                      onChange={e => setFormData({...formData, q4: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="2"
                      id="q4-2" 
                      type="radio" 
                      name="q4" 
                      checked={formData.q4 === "2"}
                      onChange={e => setFormData({...formData, q4: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="3"
                      id="q4-3" 
                      type="radio" 
                      name="q4" 
                      checked={formData.q4 === "3"}
                      onChange={e => setFormData({...formData, q4: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="4"
                      id="q4-4" 
                      type="radio" 
                      name="q4" 
                      checked={formData.q4 === "4"}
                      onChange={e => setFormData({...formData, q4: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="5"
                      id="q4-5" 
                      type="radio" 
                      name="q4" 
                      checked={formData.q4 === "5"}
                      onChange={e => setFormData({...formData, q4: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <label htmlFor="q4-5" className="px-2"><strong>Definitely</strong></label>
                    </fieldset>
                  </div>
                </div>
                <div className="col-span-2">
                <h3 className="text-left py-2 text-lg">Second step of the Analysis</h3>
                  <div ref={stepChart1Ref} />
                  <div className="pt-4">
                    <label htmlFor="q5 text-center"><strong>Question 5: I believe the results given in this chart are accurate</strong></label>
                    <fieldset className="flex justify-center py-2">
                      <label htmlFor="q5-1" className="px-2"><strong>Not at all</strong></label>
                      <input 
                      required
                      value="1"
                      id="q5-1" 
                      type="radio" 
                      name="q5" 
                      checked={formData.q5 === "1"}
                      onChange={e => setFormData({...formData, q5: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="2"
                      id="q5-2" 
                      type="radio" 
                      name="q5" 
                      checked={formData.q5 === "2"}
                      onChange={e => setFormData({...formData, q5: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="3"
                      id="q5-3" 
                      type="radio" 
                      name="q5" 
                      checked={formData.q5 === "3"}
                      onChange={e => setFormData({...formData, q5: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="4"
                      id="q5-4" 
                      type="radio" 
                      name="q5" 
                      checked={formData.q5 === "4"}
                      onChange={e => setFormData({...formData, q5: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="5"
                      id="q5-5" 
                      type="radio" 
                      name="q5" 
                      checked={formData.q5 === "5"}
                      onChange={e => setFormData({...formData, q5: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <label htmlFor="q5-5" className="px-2"><strong>Definitely</strong></label>
                    </fieldset>
                  </div>
                </div>
              </div>
            </div>
            {/* Step 4 Form */}    
            <div className={step !== 4 ? "hidden" : ""}>
              <h2 className="text-center">Task 3 - Questions</h2>
              <p className="text-left pt-4">The step chart below (same as the second one in previous step) is produced in a <strong>collaboration between ChatGPT [link] and Data Journalists from the Incubator for Media Education and Development (iMedD) [link]</strong>, a non-profit organization with a mission to support the transparency and independence in journalism and promoting meritocracy and excellence in the field. iMedD was founded in 2018 with the exclusive donation of the Stavros Niarchos Foundation (SNF).  </p>
              <div className="pt-4">
                <div ref={stepChart3Ref} />
                <div className="pt-4">
                  <label htmlFor="q6 text-center"><strong>Question 6: I believe the results produced by ChatGPT and validated by data journalists  given in this chart are accurate:</strong></label>
                  <fieldset className="flex justify-center py-2">
                    <label htmlFor="q6-1" className="px-2"><strong>Not at all</strong></label>
                    <input 
                    required
                    value="1"
                    id="q6-1" 
                    type="radio" 
                    name="q6" 
                    checked={formData.q6 === "1"}
                    onChange={e => setFormData({...formData, q6: e.target.value})}
                    className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <input 
                    required
                    value="2"
                    id="q6-2" 
                    type="radio" 
                    name="q6" 
                    checked={formData.q6 === "2"}
                    onChange={e => setFormData({...formData, q6: e.target.value})}
                    className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <input 
                    required
                    value="3"
                    id="q6-3" 
                    type="radio" 
                    name="q6" 
                    checked={formData.q6 === "3"}
                    onChange={e => setFormData({...formData, q6: e.target.value})}
                    className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <input 
                    required
                    value="4"
                    id="q6-4" 
                    type="radio" 
                    name="q6" 
                    checked={formData.q6 === "4"}
                    onChange={e => setFormData({...formData, q6: e.target.value})}
                    className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <input 
                    required
                    value="5"
                    id="q6-5" 
                    type="radio" 
                    name="q6" 
                    checked={formData.q6 === "5"}
                    onChange={e => setFormData({...formData, q6: e.target.value})}
                    className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                    />
                    <label htmlFor="q6-5" className="px-2"><strong>Definitely</strong></label>
                  </fieldset>
                </div>
              </div>   
            </div>
            {/* Step 5 Form */}    
            <div className={step !== 5 ? "hidden" : ""}>
              <h2 className="text-center">Task 4 - Questions</h2>
              <p className="text-left pt-4">The following analysis refers to the sentiment detectable in the political speeches themselves and is not at all related to audience emotions.</p>
              <div className="grid grid-cols-2 gap-4">
                <div className="col-span-2 md:col-span-1 py-2">
                  <h5 className="text-center">Kyriakos Mitsotakis</h5>
                  <div ref={speedChart_mitsotakis_newRef} />
                  <div ref={legendSentimentRef} />
                  <div className="pt-4">
                    <label htmlFor="q7 text-center"><strong>Question 7: I believe the results produced by ChatGPT and validated by data journalists  given in this chart are accurate.</strong></label>
                    <fieldset className="flex justify-center py-2">
                      <label htmlFor="q7-1" className="px-2"><strong>Not at all</strong></label>
                      <input 
                      required
                      value="1"
                      id="q7-1" 
                      type="radio" 
                      name="q7" 
                      checked={formData.q7 === "1"}
                      onChange={e => setFormData({...formData, q7: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="2"
                      id="q7-2" 
                      type="radio" 
                      name="q7" 
                      checked={formData.q7 === "2"}
                      onChange={e => setFormData({...formData, q7: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="3"
                      id="q7-3" 
                      type="radio" 
                      name="q7" 
                      checked={formData.q7 === "3"}
                      onChange={e => setFormData({...formData, q7: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="4"
                      id="q7-4" 
                      type="radio" 
                      name="q7" 
                      checked={formData.q7 === "4"}
                      onChange={e => setFormData({...formData, q7: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="5"
                      id="q7-5" 
                      type="radio" 
                      name="q7" 
                      checked={formData.q7 === "5"}
                      onChange={e => setFormData({...formData, q7: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <label htmlFor="q7-5" className="px-2"><strong>Definitely</strong></label>
                    </fieldset>
                  </div>
                </div>
                <div className="col-span-2 md:col-span-1 py-2">
                  <div className="pt-4">
                    <h5 className="text-center">Alexis Tsipras</h5>
                    <div ref={speedChart_tsiprasRef} />
                    <div ref={legendSentiment2Ref} />
                    <label htmlFor="q8 text-center"><strong>Question 8: I believe the results produced by ChatGPT and validated by data journalists  given in this chart are accurate.</strong></label>
                    <fieldset className="flex justify-center py-2 mt-6">
                      <label htmlFor="q8-1" className="px-2"><strong>Not at all</strong></label>
                      <input 
                      required
                      value="1"
                      id="q8-1" 
                      type="radio" 
                      name="q8" 
                      checked={formData.q8 === "1"}
                      onChange={e => setFormData({...formData, q8: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="2"
                      id="q8-2" 
                      type="radio" 
                      name="q8" 
                      checked={formData.q8 === "2"}
                      onChange={e => setFormData({...formData, q8: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="3"
                      id="q8-3" 
                      type="radio" 
                      name="q8" 
                      checked={formData.q8 === "3"}
                      onChange={e => setFormData({...formData, q8: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="4"
                      id="q8-4" 
                      type="radio" 
                      name="q8" 
                      checked={formData.q8 === "4"}
                      onChange={e => setFormData({...formData, q8: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <input 
                      required
                      value="5"
                      id="q8-5" 
                      type="radio" 
                      name="q8" 
                      checked={formData.q8 === "5"}
                      onChange={e => setFormData({...formData, q8: e.target.value})}
                      className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                      />
                      <label htmlFor="q8-5" className="px-2"><strong>Definitely</strong></label>
                    </fieldset>
                  </div>
                </div>                
              </div>  
              <div className="pt-2">
                <label htmlFor="q9 text-center"><strong>Question 9: I would use such a political discourse exploration tool again.</strong></label>
                <fieldset className="flex justify-center py-2">
                  <label htmlFor="q9-1" className="px-2"><strong>Not at all</strong></label>
                  <input 
                  required
                  value="1"
                  id="q9-1" 
                  type="radio" 
                  name="q9" 
                  checked={formData.q9 === "1"}
                  onChange={e => setFormData({...formData, q9: e.target.value})}
                  className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                  />
                  <input 
                  required
                  value="2"
                  id="q9-2" 
                  type="radio" 
                  name="q9" 
                  checked={formData.q9 === "2"}
                  onChange={e => setFormData({...formData, q9: e.target.value})}
                  className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                  />
                  <input 
                  required
                  value="3"
                  id="q9-3" 
                  type="radio" 
                  name="q9" 
                  checked={formData.q9 === "3"}
                  onChange={e => setFormData({...formData, q9: e.target.value})}
                  className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                  />
                  <input 
                  required
                  value="4"
                  id="q9-4" 
                  type="radio" 
                  name="q9" 
                  checked={formData.q9 === "4"}
                  onChange={e => setFormData({...formData, q9: e.target.value})}
                  className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                  />
                  <input 
                  required
                  value="5"
                  id="q9-5" 
                  type="radio" 
                  name="q9" 
                  checked={formData.q9 === "5"}
                  onChange={e => setFormData({...formData, q9: e.target.value})}
                  className="mx-2 px-2 inline bg-gray-50 border border-gray-600 text-gray-900 text-sm rounded-full focus:ring-blue-600 focus:border-blue-600 hover:cursor-pointer p-2.5" 
                  />
                <label htmlFor="q8-5" className="px-2"><strong>Definitely</strong></label>
                </fieldset>
              </div> 
            </div>   
            <div className={step !== 6 ? "hidden" : ""}>
              <h2 className="text-center">Submit your answers</h2>
              <p className="text-center pt-4">Thank you for your participation in the IANUS case studies.</p>
              <p className="text-center py-2">Please submit your answers!</p>
            </div>
          </div>
          <div className={`text-center text-red-300 ${errorVal === "" ? "" : "pt-5"}`}>{errorVal}</div>
        <div className={`mt-12 flex ${step === 0 || step === 2 ? "justify-end" : "justify-between"}`}>
          {/* previous step button */}
        <button type="button" onClick={handlePrev} className={`btn btn-primary ${step === 0 || step === 2 ? "hidden" : ""}`}>
          {(step !== 0 && step !== 2) && 
          <div>
            <svg className="inline pe-2 align-middle" xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 448 384">
              <path d="M 9 169 Q 0 179 0 192 L 0 192 Q 0 205 9 215 L 169 375 Q 179 384 192 384 Q 205 384 215 375 Q 224 365 224 352 Q 224 339 215 329 L 109 224 L 416 224 Q 430 224 439 215 Q 448 206 448 192 Q 448 178 439 169 Q 430 160 416 160 L 109 160 L 215 55 Q 224 45 224 32 Q 224 19 215 9 Q 205 0 192 0 Q 179 0 169 9 L 9 169 L 9 169 Z" />
            </svg>
            <span>Previous</span>
          </div>}
        </button>
        {/* next step button */}
        <button type="button" onClick={handleNext} className={`btn btn-primary ${step === 6 ? "hidden" : ""}`} >
        <div>
          <span>Next</span>
          <svg className="inline ps-2 align-middle" xmlns="http://www.w3.org/2000/svg" height="1em" fill="currentColor" viewBox="0 0 448 384">
            <path d="M 439 215 Q 448 205 448 192 L 448 192 Q 448 179 439 169 L 279 9 Q 269 0 256 0 Q 243 0 233 9 Q 224 19 224 32 Q 224 45 233 55 L 339 160 L 32 160 Q 18 160 9 169 Q 0 178 0 192 Q 0 206 9 215 Q 18 224 32 224 L 339 224 L 233 329 Q 224 339 224 352 Q 224 365 233 375 Q 243 384 256 384 Q 269 384 279 375 L 439 215 L 439 215 Z" />
          </svg>          
        </div>
        </button>
        {/* submit form button */}
        <button type="submit" className={`btn btn-primary ${step !== 6 ? "hidden" : ""}`}>
          Submit
        </button>
      </div>
      </form>
    </div>
  )
}

export default SurveyForm;